documents/images/graphio/stdlib/convert_vector4_shader.dot
digraph {
  rankdir = LR;
    NG_convert_vector4_shader_surface [label= "surface_unlit"];
    NG_convert_vector4_shader_surface[shape = box];
    NG_convert_vector4_shader_surface ->     NG_convert_vector4_shader_out;
    NG_convert_vector4_shader_out [label= "out"];
    NG_convert_vector4_shader_out[shape = box]; 
    NG_convert_vector4_shader_color4_to_color3 [label= "convert"];
    NG_convert_vector4_shader_color4_to_color3[shape = box];
    NG_convert_vector4_shader_color4_to_color3 ->     NG_convert_vector4_shader_surface [label= "emission_color"];
    NG_convert_vector4_shader_surface [label= "surface_unlit"];
    NG_convert_vector4_shader_surface[shape = box]; 
    NG_convert_vector4_shader_vec4_to_color4 [label= "convert"];
    NG_convert_vector4_shader_vec4_to_color4[shape = box];
    NG_convert_vector4_shader_vec4_to_color4 ->     NG_convert_vector4_shader_color4_to_color3 [label= "in"];
    NG_convert_vector4_shader_color4_to_color3 [label= "convert"];
    NG_convert_vector4_shader_color4_to_color3[shape = box]; 
    NG_convert_vector4_shader_inINT [label="in"];
    NG_convert_vector4_shader_inINT [shape = ellipse];
    NG_convert_vector4_shader_vec4_to_color4 [label="convert"];
    NG_convert_vector4_shader_inINT -> NG_convert_vector4_shader_vec4_to_color4 [label=".in"];
    NG_convert_vector4_shader_color4_to_float [label= "extract"];
    NG_convert_vector4_shader_color4_to_float[shape = box];
    NG_convert_vector4_shader_color4_to_float ->     NG_convert_vector4_shader_surface [label= "opacity"];
    NG_convert_vector4_shader_surface [label= "surface_unlit"];
    NG_convert_vector4_shader_surface[shape = box]; 
    NG_convert_vector4_shader_vec4_to_color4 [label= "convert"];
    NG_convert_vector4_shader_vec4_to_color4[shape = box];
    NG_convert_vector4_shader_vec4_to_color4 ->     NG_convert_vector4_shader_color4_to_float [label= "in"];
    NG_convert_vector4_shader_color4_to_float [label= "extract"];
    NG_convert_vector4_shader_color4_to_float[shape = box]; 
}
